class Strings:
    """
    A class for storing strings of constants.
    """

    HELLO_MSG = "Привет! 😊\nЭто AiVoiceAssistant! Ты мне можешь отправить голосовое или текстовое сообщение, и я тебе отвечу!"

    HELP_MSG = (
        "Просто отправь мне голосовое или текстовое сообщение - и я тут же отвечу!"
    )

    WAIT_MSG = "Подождите, пожалуйста...😇"

    KEY_VALUES_ARE_DEFINED = (
        "В ходе нашего обсуждения я выделила ваши следующие ценности: "
    )

    KEY_VALUES_ARE_NOT_DEFINED = "К сожалению, мне не удалось точно определить ваши ценности. Давайте попробуем обсудить это еще раз!"
